스킬레벨 = int(input("스킬 레벨을 입력해주세요 : "))
#공격력 = int(input("공격력을 입력해주세요 : "))
추가공격력 = int(input("추가공격력을 입력해주세요 : "))
#주문력 = int(input("주문력을 입력해주세요 : "))
#상대의최대체력 = int(input("상대의최대 체력을 입력해주세요 : "))
#상대가잃은체력 = int(input("상대가잃은 체력을 입력해주세요 : "))
#자신의최대체력 = int(input("자신의최대체력을 입력해주세요 : "))
#자신의현재체력 = int(input("자신의현재체력을 입력해주세요 : "))

기본피해량 = 30 + (스킬레벨 * 35)
피해량 = 기본피해량 + (추가공격력 * 0.8)
#회복량_미니언 = ?? + (추가공격력 * 0.09)
#회복량_챔피언 = ?? + (추가공격력 * 0.16)

분노_기본피해량 = 50 + (스킬레벨 * 50)
분노_피해량 = 분노_기본피해량 + (추가공격력 * 1.2)
#분노_회복량_미니언 = ?? + (추가공격력 * 0.09)
#분노_회복량_챔피언 = ?? + (추가공격력 * 0.48)

#최대회복량 = 100 + (스킬레벨 * 100)

print("피해량 " + str(피해량) + " 입니다.")
print("분노피해량 " + str(분노_피해량) + " 입니다.")
