스킬레벨 = int(input("스킬 레벨을 입력해주세요 : "))
#공격력 = int(input("공격력을 입력해주세요 : "))
#추가공격력 = int(input("추가공격력을 입력해주세요 : "))
주문력 = int(input("주문력을 입력해주세요 : "))
#상대의최대체력 = int(input("상대의최대 체력을 입력해주세요 : "))
#상대가잃은체력 = int(input("상대가잃은 체력을 입력해주세요 : "))
#자신의최대체력 = int(input("자신의최대체력을 입력해주세요 : "))
#자신의현재체력 = int(input("자신의현재체력을 입력해주세요 : "))

사슬_기본피해량 = 30 + (스킬레벨 * 20)
사슬_피해량 = 사슬_기본피해량 + (주문력 * 0.3)
속박_기본피해량 = 40 + (스킬레벨 * 40)
속박_피해량 = 속박_기본피해량 + (주문력 * 0.7)

print("사슬 피해량은 " + str(사슬_피해량) + "입니다")
print("속박 피해량은 " + str(속박_피해량) + "입니다")

